Show / Hide Table of Contents
Class GrpcService
Inheritance
System.Object
GrpcService
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public static class GrpcService
Properties
Improve this Doc   View Source
Descriptor
Service descriptor
Declaration
public static ServiceDescriptor Descriptor { get; }
Property Value
 Type |  Description
 Google.Protobuf.Reflection.ServiceDescriptor
Methods
Improve this Doc   View Source
BindService(ServiceBinderBase, GrpcService.GrpcServiceBase)
Register service method with a service binder with or without implementation. Useful when customizing the service binding logic. Note: this method is part of an experimental API that can change or be removed without any prior notice.
Declaration
public static void BindService(ServiceBinderBase serviceBinder, GrpcService.GrpcServiceBase serviceImpl)
Parameters
 Type |  Name |  Description
 Grpc.Core.ServiceBinderBase |  serviceBinder
Service methods will be bound by calling AddMethod on this object.
 GrpcService.GrpcServiceBase |  serviceImpl
An object implementing the server-side handling logic.
Improve this Doc   View Source
BindService(GrpcService.GrpcServiceBase)
Creates service definition that can be registered with a server
Declaration
public static ServerServiceDefinition BindService(GrpcService.GrpcServiceBase serviceImpl)
Parameters
 Type |  Name |  Description
 GrpcService.GrpcServiceBase |  serviceImpl
An object implementing the server-side handling logic.
Returns
 Type |  Description
 Grpc.Core.ServerServiceDefinition
 Improve this Doc
 View Source